tap "homebrew/bundle"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU compiler collection for arm-none-eabi
brew "arm-none-eabi-gcc"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Collection of portable C++ source libraries
brew "boost"
# Draw boxes around text
brew "boxes"
# C++ template library for linear algebra
brew "eigen"
# Library for processing command-line flags
brew "gflags"
# Application-level logging library
brew "glog"
# Suite of Sparse Matrix Software
brew "suite-sparse"
# Cross-platform make
brew "cmake"
# Digital camera RAW photo decoding software
brew "dcraw"
# USB programmer
brew "dfu-util"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Multi-format archive and compression library
brew "libarchive"
# Open Visual Inference And Optimization toolkit for AI inference
brew "openvino"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# OpenGL Extension Wrangler Library
brew "glew"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Manage compile and link flags for libraries
brew "pkg-config"
# File format designed to store large amounts of data
brew "hdf5"
# Simple terminal UI for git commands
brew "lazygit"
# Portable Foreign Function Interface library
brew "libffi"
# Generic library support script
brew "libtool"
# Rainbows and unicorns in your console!
brew "lolcat"
# Utility for directing compilation
brew "make"
# Development kit for the Java programming language
brew "openjdk"
# Java-based project management
brew "maven"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Cross-platform application and UI framework
brew "qt"
# Python bindings for v6 of Qt
brew "pyqt"
# Toolkit for 3D computer graphics, image processing, and visualization
brew "vtk"
# Open source computer vision library
brew "opencv"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Software for mathematics, science, and engineering
brew "scipy"
# Programmatically correct mistyped console commands
brew "thefuck"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# C++ YAML parser and emitter for YAML 1.2 spec
brew "yaml-cpp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Compact TeX distribution as alternative to the full TeX Live / MacTeX
cask "basictex"
# Terminal emulator mimicking the old cathode display
cask "cool-retro-term"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Backup/restore tool
cask "kopiaui"
